
# შემოატანინე მომხმარებელს რიცხვი და თუ უარყოფითი იყო ეგ რიცხვი დაბეჭდე შენ ტოლმისთვის მზად არ ხარ თუ დადებითია დაბეჭდე ოხ რამხელა ბიჭი ხარ ცოლის მოყვანას როდის აპირებ 




number = int(input("შეიყვანე რიცხვი: "))

if number < 0:
    print("შენ ტოლმისთვის მზად არ ხარ")
else:
    print("ოხ, რამხელა ბიჭი ხარ, ცოლის მოყვანას როდის აპირებ?")


# შემოატანინე მომხმარებელს რიცხვი და მაგ 10 და დაითვალოს უკუღმა  



number = int(input("შეიყვანე რიცხვი 10-ზე მეტი: "))

while number >= 10:
    print(number)
    number -= 1


# გამოატანინე მომხმარებელს ნადირი ვარ ნადირი 6 ჯერ 

for i in range(6):
    print("ნადირი ვარ ნადირი")

# შექმენი list სადაც ეწერება georgia და გამოიტანე მხოლოდ gia 

words = ["georgia"]
print(words[0][-3:])

# შექმენით list სადაც იქნება თქვენი საყვარელი მენტორები და დაპრინტეთ საუკეთესო მენტორები


mentors = ["გურამი", "იოანე", "ალექსანდრე"]

print ("mentors:")