#შექმენით ფუნქცია, რომელსაც არგუმენტად გადაეცემა რიცხვი, ხოლო ამ ფუნქციამ უნდა დაბეჭდოს 1-დან გადმოცემულ რიცხვამდე ყველა რიცხვი


def print_numbers (n):
    for i in range(1, n + 1):
        print(i)




#  შექმენით ფუნქცია, რომელსაც არგუმენტად გადაეცემა სახელი და დაბეჭდავს მისთვის მიესალმებას (მაგალითად: "Hello ixvis tolma"). გამოძახეთ ეს ფუნქცია 2-ჯერ და გადაეცით სხვადასხვა სახელი


def hello_tomla():
    print("Hello ixvis tolma")

#  შექმენით ფუნქცია, რომელსაც არგუმენტად გადაეცემა 2 რიცხვი. ფუნქციამ უნდა დაბეჭდოს ამ რიცხვების ნამრავლი. საბოლოოდ გამოიძახეთ ის

    
def max_number(a , b ):
    if a > b:
        print(a)
    else:
        print(b)
    







#  შექმენით ფუნქცია, რომელსაც გადასცემთ რიცხვების სიას. გადაუარეთ გადმოცემულ სიას for ციკლით და დააბრუნეთ ახალი სია, სადაც ჩამატებული იქნება გადმოცემული სიიდან მხოლოდ ის რიცხვები, რომლებიც მეტია 10-ზე. საბოლოოდ დააბრუნეთ ეს სია


def print_numbers(num):
    if num > 10:
        return ("more than 10")
    else:
        return("less than 10")






#შექმენით ფუნქცია, რომელსაც გადაეცემა ორი რიცხვების სია, გადაურეთ ორივეს for ციკლით და გაიგეთ თითოეულ სიაში რიცხვების ჯამი(შეინახეთ ცალკე ცვლადებში), გაამრავლეთ ორივე ერთმანეთზე და დააბრუნეთ
def multyplay_sums(a, b):
    return a * b

#  შექმენით ფუნქცია, რომელსაც გადაეცემა სახელების სია. შექმენით ახალის სია, სადაც ჩაამატებთ გადმოცემული სიიდან მხოლოდ იმ სახელებს, რომლებიც იწყება "N"-ზე`. საბოლოოდ დააბრუნეთ ეს სია

def names_n(names):
    return "n"


#  შექმენით ფუნქცია, რომელსაც არგუმენტად გადაეცემა ორი რიცხვი, ხოლო ამ ფუნქციამ უნდა დააბრუნოს პირველი რიცხვი აყვანილი მე-2 რიცხვის ხარისხში


def power (a, b):
    return a ** b
print(power(2, 3))
print(power(5, 2))





#  შექმენით ფუნქცია, რომელიც მიიღებს წინადადებას და დაბეჭდავს მის თითოეულ სიტყვაში სიმბოლოების რაოდენობას(ცალ-ცალკე)

def word_leghts(sentence):
    for i in range(len(words)):
        print(i)