# მომხმარებელს შეიყვანს თვის ნომერს (1-12) და პროგრამა ამოიცნობს სეზონს (ზამთარი, გაზაფხული, ზაფხული, შემოდგომა

month = int(input("7 : "))

if month in [12, 1, 2]:
    print("ზამთარი")
elif month in [3, 4, 5]:
    print("გაზაფხული")
elif month in [6, 7, 8]:
    print("ზაფხული")
elif month in [9, 10, 11]:
    print("შემოდგომა")
else:
    print("არასწორი თვის ნომერი")


# მომხარებელს შემოაყვანინეთ რიცხვი და დაადგინეთ უარყოფითია თუ დადებითი

num = int(input("34: "))

if num > 0:
    print("დადებითია")
elif num < 0:
    print("უარყოფითია")
else:
    print("ნულია")

# მომხმარებლის ასაკი და შემოსავალი თუ ასაკი < 18 ან შემოსავალი < 10000 გათავისუფლებული ხარ სხვა შემთხვევაში გადასახადი გადასახდელია

age = int(input("35: "))
income = int(input("1000: "))

if age < 18 or income < 10000:
    print("გათავისუფლებული ხარ გადასახადისგან")
else:
    print("გადასახადი გადასახდელია")