# შემოაყვანინეთ მომხმარებელს n რიცხვი და დაპრინტეთ ყველა რიცხვი ნოლიდან n+1-მდე

n = int(input("შეიყვანეთ რიცხვი n: "))
for i in range(0, n + 1):
    print(i)



#  მომხმარებელს შემოაყვანინე რიცხვი და დაბეჭდე კენტის შემთხვევაში კენტი ლეწის შემთხვევაში ლუწი

num = int(input("შეიყვანეთ რიცხვი: "))
if num % 2 == 0:
    print("ლუწი")
else:
    print("კენტი")


# შექმენი for loop- რომელიც გამოიტანს 1-100 ჩატვლით რიცხვებს და ასევე კენტია თუ ლუწი ეს რიცხვი.


for i in range(1, 101):
    if i % 2 == 0:
        print("{i} - ლუწი")
    else:
        print("{i} - კენტი")


# მომხმარებელს შემოატანინეთ ორი რიცხვი და დაბეჭდეთ უფრო მაღალი რიცხვი 

a  = int(input("შეიყვანეთ პირველი რიცხვი: "))
b = int(input("შეიყვანეთ მეორე რიცხვი: "))

if a > b:
    print(f"მეტი რიცხვია: {a}")
elif b > a:
    print(f"მეტი რიცხვია: {b}")
else:
    print("ორივე რიცხვი ტოლია")



# მომხმარებლის მიერ შეტანილი სახელის დაბეჭდვა 10-ჯერ

name = input("შეიყვანეთ თქვენი სახელი: ")
for i in range(10):
    print(name)