# კომენტარების სახით ახსენით რა არის ინდექსინგი, საიდან იწყება და როგორ ყალიბდება

# ინდექსინგი არის სიის ან სტრინგის ელემენტზე წვდომა მისი მდებარეობის (ინდექსის) მიხედვით


# შექმენით სია 10 ცალი ელემენტით, შემდეგ მეხუთე ეელმენტი შეცალეთ 5 იანით, და გამოიტანეთ მეორე ელემენტის მერე ყველა არსებული ელემენტი ყაროფითი ინდექსების საშუალებით

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
numbers[4] = 5
print(numbers[2:]) 

# შექმენით სია 80 ცალი ელემენტით, შემდეგ 65 ელემენტი შეცვალეთ "gurami" თ და გამოიტანეთ იგი უარყოფითი ინდექსებით


my_list = list(range(1, 81)) 
my_list[64] = "gurami"
print(my_list[-16])