# დაბეჭდე 5-ჯერ სიტყვა "hellow world"

for i in range(5):
    print("hello world")


# ახსნევინე კომენტარის სახით  რა არის algorith,flowchart,pseudocode.

# Algorithm (ალგორითმი) - ეს არის ნაბიჯ-ნაბიჯ ინსტრუქციების კრებული, რომელიც პრობლემის გადაჭრის გზას აღწერს.
# Flowchart (ფლოჩარტი) - ეს არის ვიზუალური დიაგრამა, რომელიც გრაფიკულად აჩვენებს ალგორითმის მოქმედებების მიმდევრობას.
# Pseudocode (პსევდოკოდი) - ტექსტური აღწერილობა ალგორითმის, რომელიც არ არის ზუსტად პროგრამირების ენა,

# FOR ციკლის დახმარებით გამოიტანე შენი საყვარელი საჭმელი 10-ჯერ

for i in range(10):
    print("ხაჭაპური")


# დააბეჭდე რიცხვები 0-დან 100-მდე

for i in range(101):
    print(i)
