 # ახსენით რისთვის გამოიყენება upper(), lower(), capitalize(), find()


#upper() სტრიქონის ყველა სიმბოლოს გარდაქმნის დიდ ასოებად.
#lower() სტრიქონის ყველა სიმბოლოს გარდაქმნის პატარა ასოებად
# find() პოულობს სტრიქონში კონკრეტული ნაწილის ადგილმდებარეობას 
#capitalize() ტრიქონის პირველი ასოს გარდაქმნის დიდ ასოდ, დანარჩენს  პატარა ასოებად.






# რისი გაკეთება შეგვიძლია დოტ ნოტაციით?
# ატრიბუტებზე წვდომა და მეთოდების გამოძახებისათვი


# len() აბრუნებს ობიექტის სიგრძეს — ელემენტების რაოდენობას.
#  insert() სიის კონკრეტულ ინდექსზე ჩასვამს ელემენტს.
# append() სიის ბოლოს ამატებს ერთ ელემენტს.
#pop() სიის ბოლო ელემენტს შლის და აბრუნებს მას






#ახსენით რა განსხავებაა მეთოდსა და ჩაშენებული-ფუნქციის შორის 
# ჩაშენებული ფუნქციa არის გლობალური ფუნქცია
#  მეთოდი მეთოდი არის ფუნქცია, რომელიც დაკავშირებულია ობიექტთან.