# მომხმარებელს შემოაყვანინე რიცხვი და დაბეჭდე, დადებითია თუ უარყოფითი.


num = int(input("11: "))

if num > 0:
    print("რიცხვი დადებითია")
elif num < 0:
    print("რიცხვი უარყოფითია")
else:
    print("რიცხვი ნულია")

# მომხმარებელს შემოაყვანინე რიცხვი და დაბეჭდე კენტის შემთხვევაში კენტი ლეწის შემთხვევაში ლუწი

num = int(input("13: "))

if num % 2 == 0:
    print("ლუწი")
else:
    print("კენტი")


#მომხმარებელს შემოაყვანინე გამოცდის ქულა თუ მიიღო 100 დაბეჭდოს მალადეც თუ მიიღო 50 ნაკლები ვერ ჩააბარე 


score = int(input("enter youre score:"))

if score == 100:
    print("მალადეც!")
elif score < 50:
    print("ვერ ჩააბარე")
else:
    print("შედეგი მიღებულია, მაგრამ სრულ ქულას ვერ მიაღწიე")