# შექმენი სია სადაც თქვენი საყვარელი საწმელები იქნება 


sia=["ხინკალი,მწვადი,ხაჭაპური,ლობიანი"]
print(sia)


# შექმენით ახალი სია სადაც იქნება color ცვლადი და ცისარტყელის ფერები იქნება ცხრილში და მხოლოდ ცივ ფერებს გამოიტანეთ 



cold_colors =["ლურჯი,მწვანე,იისფერი"]
print(cold_colors)


# შექმენით სია სადაც 5 ცხოველი იქნება და მხოლოდ 1indx და 2indx გამოიტანთ 

animals=["ლომი,ვეფხვი,კურდღელი,ზღარბი,სპილო"]
print(animals)



# სიები ინახავენ ელემენტებს ელთობრივად მაგალითად ცხოველები, რიცხვები.


