# 1)  კომენტარების სახით ახსენით რამდენი შედარების ოპერატორია და თითოეული რისთვის გამოიყენება

# == --> გამოიყენება იმისთვის, რომ შევამოწმოთ, ხომ არ არის ორი ცვლადი ან მნიშვნელობა ტოლი.

# != --> გამოიყენება იმისთვის, რომ შევამოწმოთ, ხომ არ არის ორი ცვლადი ან მნიშვნელობა განსხვავებული.

# > --> შეადარებს, არის თუ არა ერთი ცვლადი ან მნიშვნელობა უფრო დიდი მეორეზე.

# < --> შეადარებს, არის თუ არა ერთი ცვლადი ან მნიშვნელობა უფრო მცირე მეორეზე.

# >= --> გამოიყენება იმისთვის, რომ შევამოწმოთ, არის თუ არა ერთი ცვლადი ან მნიშვნელობა უფრო დიდი ან ტოლი მეორეს.

# <= --> შეადარებს, არის თუ არა ერთი ცვლადი ან მნიშვნელობა უფრო მცირე ან ტოლი მეორეს.





# კომენტარების სახით ახსენი რა განსხვავებაა and და or ლოგიკურ ოპერატორებს შორის და რა თვისებები გააჩნიათ


 #`or` ოპერატორი:თუ ნებისმიერი ერთი პირობა True-ა, მაშინ შედეგი იქნება True.:
 # `and` ოპერატორი:თუ ორივე მხარე True-ა, მაშინ შედეგიც True იქნება.
