# ინდექსინგი  გამოიყენება სიიდან ან კოლექციიდან კონკრეტული ელემენტის მისაღებად მის ინდექსზე დაყრდნობით. სიებში ელემენტებს ინდექსები 0-დან ეწყებათ. მაგალითად, თუ გვყავს სია my_list = [10, 20, 30], მაშინ my_list[0] ნიშნავს 10-ს.




my_list = [5, 10, 15, 20, 25, 30, 35, 40, 45, 50]

print( my_list[0])
print( my_list[1])
print( my_list[2])
print(my_list[3])
print( my_list[4])


my_list: 5
my_list: 10 
my_list: 15
my_list: 20
my_list: 25

PRINT(my_list)






#ფუნქცია არის კოდის ბლოკი, რომელსაც თავისი სახელი აქვს და რომელიც კონკრეტული ამოცანის შესასრულებლად გამოიყენება. ფუნქციის მთავარი მიზანია კოდის ორგანიზება, გადამუშავება და ხელახლა გამოყენება.


# როცა დეფს-ს ვწერთ, ამას ვეუბნებით Python-ს რომ ახლა მე ვქმნი ახალ ფუნქციას!

# ფუნქციის სახელი – შეგიძლია თავად დაარქვა სახელი (მაგ: გამარჯობა)

# რატომ უნდა გამოვიძახოთ ფუქნცია?

# მარტივი კოდის შესაქმნელად